app/views/projects/show.html.erb

<h2>Tasks</h2>
<% @project.tasks.each do |task| %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = $1  [["project_id", 21]]