app/controllers/projects_controller.rb

	def create
  		@project = Project.new(project_params)
		  if @project.save
---
INSERT INTO "projects" ("title", "text", "sdate", "edate", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "aasdw"], ["text", "effsdfs"], ["sdate", "2019-04-07"], ["edate", "2019-04-28"], ["created_at", "2019-04-21 10:43:16.356905"], ["updated_at", "2019-04-21 10:43:16.356905"]]

	def update
		@project = Project.find(params[:id])
			if @project.update(project_params)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "projects" SET "title" = $1, "text" = $2, "sdate" = $3, "edate" = $4, "updated_at" = $5 WHERE "projects"."id" = $6  [["title", "1111sad"], ["text", "2adsasdasd"], ["sdate", "2019-04-14"], ["edate", "2019-04-28"], ["updated_at", "2019-04-21 11:06:21.355313"], ["id", 3]]

	def destroy
	    @project = Project.find(params[:id])
	    @project.destroy
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 1]]