app/controllers/tasks_controller.rb

	def edit
	    @project = Project.find(params[:project_id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]

	def create
	    @project = Project.find(params[:project_id])
	    @task = @project.tasks.create(tasks_params)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]
INSERT INTO "tasks" ("name", "description", "status", "employee", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

	def destroy
	    @project = Project.find(params[:project_id])
	    @task = @project.tasks.find(params[:id])
	    @task.destroy
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."project_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["project_id", 22], ["id", 11], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 11]]